# 應用場景
    # 字典：適合儲存具有關聯性的資料，例如用戶資訊、設定檔等。
    # 集合：適合用於去重、集合運算或檢查某元素是否存在的情況。
# 總結：
    # 字典是一種儲存 鍵值對 的資料結構，提供根據鍵快速查找值的功能。
    # 集合是一種無序且唯一的元素集合，常用於去重和集合運算。(元素不能重複，重複的值會自動去除)

# 字典创建

a = {
    1: 'a',
    2: 'b',
    '3': 'c'
}


# 不可改变的数据类型


l1 = [1, 2, 3]
#
#
# b = {
#     l1: 1
# }

t1 = (1, 2, 3)

c = {
    t1: l1
}

print(c)


d = dict()
print(d)

e = dict(a=1, b=2, c='a')
print(e)


# 字典的访问

print(e['c'])

e['d'] = 123

print(e)

e['c'] = 3

print(e)

f = {1:1}

g = {
    f: [1,2,3]
}

f[2] = 2
f[3] = 3
